## Importing libraries

In [1]:
import pandas as pd
import numpy as np

## Load Data

In [2]:
df = pd.read_csv("property data.csv")
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y            1        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

## Standard Missing Values
- Values which ca be detected by Pandas

In [9]:
# Looking at the ST_NUM column
print(df['ST_NUM'])

0    104.0
1    197.0
2      NaN
3    201.0
4    203.0
5    207.0
6      NaN
7    213.0
8    215.0
Name: ST_NUM, dtype: float64

In [10]:
print(df['ST_NUM'].isnull())

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
8    False
Name: ST_NUM, dtype: bool

Taking a look at the column, we can see that Pandas filled in the blank space with “NA”. Using the isnull() method, we can confirm that both the missing value and “NA” were recognized as missing values. Both boolean responses are True.

## Non-Standard Missing Values
Sometimes it might be the case where there’s missing values that have different formats.

Looking at NUM_BEDROOMS column

In this column, there’s four missing values.
- n/a
- NA
- na

In [11]:
# Looking at the NUM_BEDROOMS column
print(df['NUM_BEDROOMS'])

0      3
1      3
2    NaN
3      1
4      3
5    NaN
6      2
7      1
8     na
Name: NUM_BEDROOMS, dtype: object

In [12]:
print(df['NUM_BEDROOMS'].isnull())

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7    False
8    False
Name: NUM_BEDROOMS, dtype: bool

Just like before, Pandas recognized the “NA” as a missing value. Unfortunately, the other types weren’t recognized.
If there’s multiple users manually entering data, then this is a common problem.
An easy way to detect these various formats is to put them in a list.

In [19]:
# Making a list of missing value types
missing_values = ["n/a", "na"]
df = pd.read_csv("property data.csv", na_values = missing_values)

In [20]:
# Looking at the NUM_BEDROOMS column
print(df['NUM_BEDROOMS'])

0    3.0
1    3.0
2    NaN
3    1.0
4    3.0
5    NaN
6    2.0
7    1.0
8    NaN
Name: NUM_BEDROOMS, dtype: float64

In [21]:
print(df['NUM_BEDROOMS'].isnull())

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7    False
8     True
Name: NUM_BEDROOMS, dtype: bool

This time, all of the different formats were recognized as missing values.

## Unexpected Missing Values

For example, if our feature is expected to be a string, but there’s a numeric type, then technically this is also a missing value.

In [22]:
# Looking at the OWN_OCCUPIED column
print(df['OWN_OCCUPIED'])

0      Y
1      N
2      N
3     12
4      Y
5      Y
6    NaN
7      Y
8      Y
Name: OWN_OCCUPIED, dtype: object

In [23]:
print(df['OWN_OCCUPIED'].isnull())

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
8    False
Name: OWN_OCCUPIED, dtype: bool

In the fourth row, there’s the number 12. The response for Owner Occupied should clearly be a string (Y or N), so this numeric type should be a missing value.
This example is a little more complicated so we’ll need to think through a strategy for detecting these types of missing values. 

There’s a number of different approaches:
- Loop through the OWN_OCCUPIED column
- Try and turn the entry into an integer
- If the entry can be changed into an integer, enter a missing value
- If the number can’t be an integer, we know it’s a string, so keep going

In [24]:
# Detecting numbers 
cnt=0
for row in df['OWN_OCCUPIED']:
    try:
        int(row)
        df.loc[cnt, 'OWN_OCCUPIED']=np.nan
    except ValueError:
        pass
    cnt+=1

We’re looping through each entry in the “Owner Occupied” column. To try and change the entry to an integer, we’re using int(row).
If the value can be changed to an integer, we change the entry to a missing value using Numpy’s np.nan.

On the other hand, if it can’t be changed to an integer, we pass and keep going.
Using try and except ValueError is called exception handling, and we use this to handle errors.

If we were to try and change an entry into an integer and it couldn’t be changed, then a ValueError would be returned, and the code would stop. To deal with this, we use exception handling to recognize these errors, and keep going.

Another important method is the .loc method. This is the preferred Pandas method for modifying entries in place.

## Summarizing Missing Values
After we’ve cleaned the missing values, we will probably want to summarize them. For instance, we might want to look at the total number of missing values for each feature.

In [26]:
# Total missing values for each feature
print(df.isnull().sum())

PID             1
ST_NUM          2
ST_NAME         0
OWN_OCCUPIED    2
NUM_BEDROOMS    3
NUM_BATH        1
SQ_FT           1
dtype: int64

Or check if we have any missing values at all.

In [27]:
# Any missing values?
print(df.isnull().values.any())

True

Total count of missing values.

In [28]:
# Total number of missing values
print(df.isnull().sum().sum())

10

## Replacing
Often times we’ll have to figure out how to handle missing values.
Sometimes we’ll want to delete those rows, other times we’ll replace them.

In [29]:
# Replace missing values with a number
df['ST_NUM'].fillna(125, inplace=True)

In [30]:
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5    --
2  100003000.0   125.0   LEXINGTON            N           NaN        1   850
3  100004000.0   201.0    BERKELEY          NaN           1.0      NaN   700
4          NaN   203.0    BERKELEY            Y           3.0        2  1600
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800
6  100007000.0   125.0  WASHINGTON          NaN           2.0   HURLEY   950
7  100008000.0   213.0     TREMONT            Y           1.0        1   NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800

Location based imputation.

In [31]:
df.loc[4,'PID'] = 100005000.0

In [32]:
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5    --
2  100003000.0   125.0   LEXINGTON            N           NaN        1   850
3  100004000.0   201.0    BERKELEY          NaN           1.0      NaN   700
4  100005000.0   203.0    BERKELEY            Y           3.0        2  1600
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800
6  100007000.0   125.0  WASHINGTON          NaN           2.0   HURLEY   950
7  100008000.0   213.0     TREMONT            Y           1.0        1   NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800

Common way to replace missing values is using a median.

In [33]:
# Replace using median 
median = df['NUM_BEDROOMS'].median()
df['NUM_BEDROOMS'].fillna(median, inplace=True)

In [34]:
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5    --
2  100003000.0   125.0   LEXINGTON            N           2.5        1   850
3  100004000.0   201.0    BERKELEY          NaN           1.0      NaN   700
4  100005000.0   203.0    BERKELEY            Y           3.0        2  1600
5  100006000.0   207.0    BERKELEY            Y           2.5        1   800
6  100007000.0   125.0  WASHINGTON          NaN           2.0   HURLEY   950
7  100008000.0   213.0     TREMONT            Y           1.0        1   NaN
8  100009000.0   215.0     TREMONT            Y           2.5        2  1800

## Conclusion
Dealing with messy data is inevitable. Data cleaning is just part of the process on a data science project.